portal/app/controllers/listings_controller.rb

  def create
    @listing = Listing.new(listing_params)
    if @listing.save
---
INSERT INTO "listings" ("created_at", "updated_at", "title", "fields", "levels", "work_types", "locations", "shifts", "logo_loc", "logo_dsc") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    respond_to do |format|
      if @listing.update(listing_params)
---
UPDATE "listings" SET "fields" = $1, "levels" = $2, "work_types" = $3, "locations" = $4, "shifts" = $5, "updated_at" = $6 WHERE "listings"."id" = $7