app/controllers/listings_controller.rb

INSERT INTO "listings" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-09-27 13:48:00.237305"], ["updated_at", "2019-09-27 13:48:00.237305"]]
---
  def create
    @listing = Listing.new(listing_params)

    respond_to do |format|
      if @listing.save

UPDATE "listings" SET "title" = ?, "fields" = ?, "levels" = ?, "work_types" = ?, "locations" = ?, "shifts" = ?, "logo_loc" = ?, "logo_dsc" = ?, "updated_at" = ? WHERE "listings"."id" = ?
---
  def update
    respond_to do |format|
      if @listing.update(listing_params)