app/controllers/listings_controller.rb

  def update
    listing = Listing.find(params[:id])
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]